asisecond/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (author LIKE '%henryk%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (author LIKE '%a%')
---
def index
    @books = Book.paginate(:page => params[:page]).search(params[:search])

INSERT INTO "books" ("author", "cover", "created_at", "isbn", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Adam Mickiewicz"], ["cover", "audi.jpg"], ["created_at", Sat, 15 Mar 2014 19:43:35 UTC +00:00], ["isbn", ""], ["title", ""], ["updated_at", Sat, 15 Mar 2014 19:43:35 UTC +00:00]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "isbn" = ?, "cover" = ?, "updated_at" = ? WHERE "books"."id" = 3  [["isbn", "22222"], ["cover", "audi.jpg"], ["updated_at", Sat, 08 Mar 2014 12:06:05 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_book
      @book = Book.find(params[:id])